capita-API_tests/src/test/java/data/GetByCorrespondenceId_notexisting.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:doc="https://www.capita.co.uk/TfL/docstore">
   <soapenv:Header/>
   <soapenv:Body>
      <doc:GetByCorrespondenceId>
         <!--Optional:-->
         <doc:sourceSystem>#(sourcesystem)</doc:sourceSystem>
         <!--Optional:-->
         <doc:correspondenceId>abcddzz1249</doc:correspondenceId>
      </doc:GetByCorrespondenceId>
   </soapenv:Body>
</soapenv:Envelope>